## 연습문제] student_zero2.json을 읽어서 DataFrame으로 변형하세요.

In [4]:
data = { "response": {"body":  { "student_list": [ {"age": 45, "major": "경영학", "name": "영호","sex": "남" }, { "age": 30, "major": "정치외교", "name": "세중", "sex": "남" }, {    "age": 30, "major": "신문방송학", "name": "치우",  "sex": "남"  }  ]        }    }}

In [7]:
type(data)

dict

In [11]:
column_list=[]
all_data=[]
student_list = data['response'] ['body']['student_list']

In [12]:
student_list

[{'age': 45, 'major': '경영학', 'name': '영호', 'sex': '남'},
 {'age': 30, 'major': '정치외교', 'name': '세중', 'sex': '남'},
 {'age': 30, 'major': '신문방송학', 'name': '치우', 'sex': '남'}]

In [13]:
is_first=True
for student in student_list:
    row_data_list=[]
    for key, value in student.items():
        if is_first:
            column_list.append(key)
        row_data_list.append(value)
    all_data.append(row_data_list)
    is_first=False

In [14]:
row_data_list

[30, '신문방송학', '치우', '남']

In [15]:
all_data

[[45, '경영학', '영호', '남'], [30, '정치외교', '세중', '남'], [30, '신문방송학', '치우', '남']]

In [16]:
import pandas as pd
df = pd.DataFrame(all_data, columns=column_list)
df

   age  major name sex
0   45    경영학   영호   남
1   30   정치외교   세중   남
2   30  신문방송학   치우   남